MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0L1053CFJ/mcu.h
/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_peripherals
 * @{
 */

/* =========================================================================================================================== */
/* ================                                          R_ADC_D                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief A/D Converter (R_ADC_D)
 */

typedef struct                         /*!< (@ 0x400A1800) R_ADC_D Structure                                          */
{
    union
    {
        __IOM uint8_t ADM0;            /*!< (@ 0x00000000) A/D Converter Mode Register 0                              */

        struct
        {
            __IOM uint8_t ADCE : 1;    /*!< [0..0] A/D Voltage Comparator Operation Control                           */
            __IOM uint8_t LV   : 2;    /*!< [2..1] Select Operation Voltage Mode                                      */
            __IOM uint8_t FR   : 3;    /*!< [5..3] Select Conversion Clock (fAD)                                      */
            __IOM uint8_t ADMD : 1;    /*!< [6..6] Specification of the A/D Conversion Channel Selection
                                        *   Mode                                                                      */
            __IOM uint8_t ADCS : 1;    /*!< [7..7] A/D Conversion Operation Control                                   */
        } ADM0_b;
    };

    union
    {
        __IOM uint8_t ADS;             /*!< (@ 0x00000001) Analog Input Channel Specification Register                */

        struct
        {
            __IOM uint8_t ADS   : 5;   /*!< [4..0] Selection of the Analog Input Channel (See to )                    */
            uint8_t             : 2;
            __IOM uint8_t ADISS : 1;   /*!< [7..7] Select Internal or External of Analog Input (See to )              */
        } ADS_b;
    };

    union
    {
        __IOM uint8_t ADM1;            /*!< (@ 0x00000002) A/D Converter Mode Register 1                              */

        struct
        {
            __IOM uint8_t ADTRS : 3;   /*!< [2..0] Selection of the Hardware Trigger Signal                           */
            __IOM uint8_t ADLSP : 1;   /*!< [3..3] PCLKB Input Frequency Setting                                      */
            uint8_t             : 1;
            __IOM uint8_t ADSCM : 1;   /*!< [5..5] Specification of the A/D Conversion Mode                           */
            __IOM uint8_t ADTMD : 2;   /*!< [7..6] Selection of the A/D Conversion Trigger Mode                       */
        } ADM1_b;
    };
    __IM uint8_t  RESERVED;
    __IM uint16_t RESERVED1[134];

    union
    {
        __IOM uint8_t ADM2;            /*!< (@ 0x00000110) A/D Converter Mode Register 2                              */

        struct
        {
            __IOM uint8_t ADTYP  : 2;  /*!< [1..0] ADTYP                                                              */
            __IOM uint8_t AWC    : 1;  /*!< [2..2] AWC                                                                */
            __IOM uint8_t ADRCK  : 1;  /*!< [3..3] ADRCK                                                              */
            uint8_t              : 1;
            __IOM uint8_t ADREFM : 1;  /*!< [5..5] ADREFM                                                             */
            __IOM uint8_t ADREFP : 2;  /*!< [7..6] ADREFP                                                             */
        } ADM2_b;
    };
    __IOM uint8_t ADUL;                /*!< (@ 0x00000111) Conversion Result Comparison Upper Limit Setting
                                        *                  Register                                                   */
    __IOM uint8_t ADLL;                /*!< (@ 0x00000112) Conversion Result Comparison Lower Limit Setting
                                        *                  Register                                                   */

    union
    {
        __IOM uint8_t ADTES;           /*!< (@ 0x00000113) A/D Test Register                                          */

        struct
        {
            __IOM uint8_t ADTES : 2;   /*!< [1..0] Selection of A/D Conversion Target for Testing                     */
            uint8_t             : 6;
        } ADTES_b;
    };
    __IM uint16_t RESERVED2[6];

    union
    {
        __IM uint16_t ADCR[4];         /*!< (@ 0x00000120) A/D Conversion Result Register                             */

        struct
        {
            uint16_t            : 8;
            __IM uint16_t ADCRH : 8;   /*!< [15..8] 8-bit A/D Conversion Result Register                              */
        } ADCR_b[4];
    };
} R_ADC_D_Type;                        /*!< Size = 296 (0x128)                                                        */

/* =========================================================================================================================== */
/* ================                                           R_BUS                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Bus Interface (R_BUS)
 */

typedef struct                          /*!< (@ 0x40003000) R_BUS Structure                                            */
{
    __IOM R_BUS_CSa_Type CSa[8];        /*!< (@ 0x00000000) CS Registers                                               */
    __IM uint32_t        RESERVED[480];
    __IOM R_BUS_CSb_Type CSb[8];        /*!< (@ 0x00000800) CS Registers                                               */

    union
    {
        __IOM uint16_t CSRECEN;         /*!< (@ 0x00000880) CS Recovery Cycle Insertion Enable Register                */

        struct
        {
            __IOM uint16_t RCVEN0  : 1; /*!< [0..0] Separate Bus Recovery Cycle Insertion Enable                       */
            __IOM uint16_t RCVEN1  : 1; /*!< [1..1] Separate Bus Recovery Cycle Insertion Enable                       */
            __IOM uint16_t RCVEN2  : 1; /*!< [2..2] Separate Bus Recovery Cycle Insertion Enable                       */
            __IOM uint16_t RCVEN3  : 1; /*!< [3..3] Separate Bus Recovery Cycle Insertion Enable                       */
            __IOM uint16_t RCVEN4  : 1; /*!< [4..4] Separate Bus Recovery Cycle Insertion Enable                       */
            __IOM uint16_t RCVEN5  : 1; /*!< [5..5] Separate Bus Recovery Cycle Insertion Enable                       */
            __IOM uint16_t RCVEN6  : 1; /*!< [6..6] Separate Bus Recovery Cycle Insertion Enable                       */
            __IOM uint16_t RCVEN7  : 1; /*!< [7..7] Separate Bus Recovery Cycle Insertion Enable                       */
            __IOM uint16_t RCVENM0 : 1; /*!< [8..8] Multiplexed Bus Recovery Cycle Insertion Enable                    */
            __IOM uint16_t RCVENM1 : 1; /*!< [9..9] Multiplexed Bus Recovery Cycle Insertion Enable                    */
            __IOM uint16_t RCVENM2 : 1; /*!< [10..10] Multiplexed Bus Recovery Cycle Insertion Enable                  */
            __IOM uint16_t RCVENM3 : 1; /*!< [11..11] Multiplexed Bus Recovery Cycle Insertion Enable                  */
            __IOM uint16_t RCVENM4 : 1; /*!< [12..12] Multiplexed Bus Recovery Cycle Insertion Enable                  */
            __IOM uint16_t RCVENM5 : 1; /*!< [13..13] Multiplexed Bus Recovery Cycle Insertion Enable                  */
            __IOM uint16_t RCVENM6 : 1; /*!< [14..14] Multiplexed Bus Recovery Cycle Insertion Enable                  */
            __IOM uint16_t RCVENM7 : 1; /*!< [15..15] Multiplexed Bus Recovery Cycle Insertion Enable                  */
        } CSRECEN_b;
    };
    __IM uint16_t          RESERVED1;
    __IM uint32_t          RESERVED2[223];
    __IOM R_BUS_SDRAM_Type SDRAM;      /*!< (@ 0x00000C00) SDRAM Registers                                            */
    __IM uint32_t          RESERVED3[235];

    union
    {
        __IOM R_BUS_OAD_Type  OAD;     /*!< (@ 0x00001000) Bus Operation After Detection Registers                    */
        __IOM R_BUS_BUSM_Type BUSM[6]; /*!< (@ 0x00001000) Master Bus Control Registers                               */
    };
    __IM uint32_t RESERVED4[58];

    union
    {
        union
        {
            __IOM uint32_t BUSMABT;      /*!< (@ 0x00001100) Bus Master Arbitration Control Register.                   */

            struct
            {
                __IOM uint32_t ARBS : 1; /*!< [0..0] Arbitration Select for GDSSBI.                                     */
                uint32_t            : 31;
            } BUSMABT_b;
        };
        __IOM R_BUS_BUSS_Type BUSS[18];  /*!< (@ 0x00001100) Slave Bus Control Register Array                           */
    };
    __IM uint32_t RESERVED5[46];

    union
    {
        __IOM R_BUS_BUSSABT0_Type BUSSABT0; /*!< (@ 0x00001200) Bus Slave Arbitration Control 0 Registers                  */
        __IOM R_BUS_BUSSABT1_Type BUSSABT1; /*!< (@ 0x00001200) Bus Slave Arbitration Control 1 Registers                  */
    };
    __IM uint32_t RESERVED6[33];

    union
    {
        __IOM uint32_t BUSDIVBYP;        /*!< (@ 0x00001300) Bus Divider Bypass Register.                               */

        struct
        {
            __IOM uint32_t EDMABPE  : 1; /*!< [0..0] Divider for EDMACBI bypass enable.                                 */
            uint32_t                : 2;
            __IOM uint32_t GDSSBPE  : 1; /*!< [3..3] Divider for GDSSBI bypass enable.                                  */
            uint32_t                : 12;
            __IOM uint32_t CPU0SBPE : 1; /*!< [16..16] Divider for CPUSAHBI bypass enable.                              */
            uint32_t                : 15;
        } BUSDIVBYP_b;
    };
    __IM uint32_t RESERVED7[63];

    union
    {
        __IOM uint16_t BUSTHRPUT;      /*!< (@ 0x00001400) Graphic Bus Throughput Control Register                    */

        struct
        {
            __IOM uint16_t DIS : 1;    /*!< [0..0] Bandwidth Control Function                                         */
            uint16_t           : 15;
        } BUSTHRPUT_b;
    };
    __IM uint16_t            RESERVED8;
    __IM uint32_t            RESERVED9[255];
    __IOM R_BUS_BUSERRa_Type BUSERRa[12]; /*!< (@ 0x00001800) Bus Error Registers                                        */
    __IM uint32_t            RESERVED10[16];

    union
    {
        __IOM R_BUS_BTZFERR_Type BTZFERR[4]; /*!< (@ 0x00001900) Bus TZF Error Registers                                    */
        __IOM R_BUS_BMSAERR_Type BMSAERR[9]; /*!< (@ 0x00001900) Bus Master Security Attribution Unit Error Address
                                              *                  and Read/Write Status registers.                           */
    };
    __IM uint32_t RESERVED11[28];

    union
    {
        __IOM R_BUS_BUSERRb_Type    BUSERRb[12]; /*!< (@ 0x00001A00) Bus Error Registers                                        */
        __IOM R_BUS_DMACDTCERR_Type DMACDTCERR;  /*!< (@ 0x00001A00) DMAC/DTC Error Registers                                   */
    };
    __IM uint32_t           RESERVED12[16];
    __IOM R_BUS_MBWERR_Type MBWERR;              /*!< (@ 0x00001B00) Master Bufferable Write Error Registers                    */
    __IM uint32_t           RESERVED13[5];
    __IOM R_BUS_MBWERR_Type SBWERR;              /*!< (@ 0x00001B20) Slave Bufferable Write Error Registers                     */
} R_BUS_Type;                                    /*!< Size = 6956 (0x1b2c)                                                      */

/* =========================================================================================================================== */
/* ================                                           R_CRC                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Cyclic Redundancy Check (CRC) Calculator (R_CRC)
 */

